In [86]:
import pandas as pd

In [87]:
pd.set_option('display.max_columns' , 85)
pd.set_option('display.max_rows' ,85)

In [88]:
people={
 'first' : ["ahmed","mohamed","kamal" , "ahmed"],
    'last': ["ali", "ibrahem" , "sayd", "mahmoud"],
    'age' : [23,13,45,34]
}

In [89]:
people

{'first': ['ahmed', 'mohamed', 'kamal', 'ahmed'],
 'last': ['ali', 'ibrahem', 'sayd', 'mahmoud'],
 'age': [23, 13, 45, 34]}

In [90]:
df = pd.DataFrame(people)

In [91]:
df

     first     last  age
0    ahmed      ali   23
1  mohamed  ibrahem   13
2    kamal     sayd   45
3    ahmed  mahmoud   34

In [92]:
df.dtypes

first    object
last     object
age       int64
dtype: object

In [93]:
df.columns

Index(['first', 'last', 'age'], dtype='object')

In [94]:
df.columns = ['frist_name', 'last_name', 'age']

In [95]:
df

  frist_name last_name  age
0      ahmed       ali   23
1    mohamed   ibrahem   13
2      kamal      sayd   45
3      ahmed   mahmoud   34

In [96]:
df.columns = [x.upper() for x in df.columns]

In [97]:
df.columns

Index(['FRIST_NAME', 'LAST_NAME', 'AGE'], dtype='object')

In [98]:
df.columns = df.columns.str.replace('_', ' ')

In [99]:
df.columns

Index(['FRIST NAME', 'LAST NAME', 'AGE'], dtype='object')

In [100]:
df.rename(columns= {'FRIST NAME': 'FIRST','LAST NAME': 'LAST'})df.rename(columns= {'FRIST NAME': 'FIRST','LAST NAME': 'LAST'})

SyntaxError: invalid syntax (773857120.py, line 1)

In [101]:
df.loc[1, 'AGE' ]

13

In [102]:
df.loc[1, 'AGE' ] = 14

In [103]:
df

  FRIST NAME LAST NAME  AGE
0      ahmed       ali   23
1    mohamed   ibrahem   14
2      kamal      sayd   45
3      ahmed   mahmoud   34

In [104]:
df['AGE'].unique()

array([23, 14, 45, 34])

In [105]:
filter  = (df['AGE'] == 23)

In [106]:
df[filter]['AGE'] = 24

/var/folders/k2/5_07psxj3qz4yhw3pvkntffr0000gn/T/ipykernel_2936/1969530097.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filter]['AGE'] = 24

In [107]:
df

  FRIST NAME LAST NAME  AGE
0      ahmed       ali   23
1    mohamed   ibrahem   14
2      kamal      sayd   45
3      ahmed   mahmoud   34

In [108]:
df.loc[0, 'AGE'] = 24

In [109]:
df

  FRIST NAME LAST NAME  AGE
0      ahmed       ali   24
1    mohamed   ibrahem   14
2      kamal      sayd   45
3      ahmed   mahmoud   34

In [110]:
df.rename(columns= {'FRIST NAME': 'first','LAST NAME': 'last', 'AGE' :'age'}, inplace=True)

In [111]:
df['first'] = df['first'].str.upper()

In [112]:
 df.loc[0, 'first']

'AHMED'

In [113]:
df['last'] = df['last'].apply(lambda x: x.upper())

In [114]:
df

     first     last  age
0    AHMED      ALI   24
1  MOHAMED  IBRAHEM   14
2    KAMAL     SAYD   45
3    AHMED  MAHMOUD   34

In [115]:
def change_to_lower(last_name):
    return last_name.lower()
    
df['last'] = df['last'].apply(change_to_lower)

In [116]:
df

     first     last  age
0    AHMED      ali   24
1  MOHAMED  ibrahem   14
2    KAMAL     sayd   45
3    AHMED  mahmoud   34

In [124]:
df.apply(len)

first    4
last     4
age      4
dtype: int64

In [134]:
df['first'] = df['last'].replace({'ali':'AH'})

In [135]:
df

     first     last  age
0       AH      ali   24
1  ibrahem  ibrahem   14
2     sayd     sayd   45
3  mahmoud  mahmoud   34